
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS2
* Delete
  * azurerm_key_vault_secret.POSTGRES-USER


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS2 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name           = "recipe-backend-POSTGRES-PASS2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id             = "https://toffeesi-stg.vault.azure.net/secrets/recipe-backend-POSTGRES-USER/ce09cc37c5d24e789eff374bdd86e3cb" -> null
      - key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg" -> null
      - name           = "recipe-backend-POSTGRES-USER" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "ce09cc37c5d24e789eff374bdd86e3cb" -> null
      - versionless_id = "https://toffeesi-stg.vault.azure.net/secrets/recipe-backend-POSTGRES-USER" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":48,"Program":"tfcmt","SHA1":"","Vars":{}} -->